// BSLLS:MagicNumber-off
// BSLLS:MissingVariablesDescription-off
// BSLLS:PublicMethodsDescription-off
// BSLLS:MissingParameterDescription-off
// BSLLS:MissingReturnedValueDescription-off
#Использовать "../../.."
#Использовать asserts
#Использовать moskito
#Использовать extends

#Область Тесты

&Тест
Процедура ОтелЭкспортерСпановРеализуетИнтерфейс() Экспорт
    Валидатор = Новый ВалидаторРеализации;
    Объект = Новый ОтелЭкспортерСпанов(Неопределено);
    Валидатор.ИнтерфейсыРеализованыКорректно(Объект);
КонецПроцедуры

&Тест
Процедура ОтелЭкспортерЛоговРеализуетИнтерфейс() Экспорт
    Валидатор = Новый ВалидаторРеализации;
    Объект = Новый ОтелЭкспортерЛогов(Неопределено);
    Валидатор.ИнтерфейсыРеализованыКорректно(Объект);
КонецПроцедуры

&Тест
Процедура ОтелЭкспортерМетрикРеализуетИнтерфейс() Экспорт
    Валидатор = Новый ВалидаторРеализации;
    Объект = Новый ОтелЭкспортерМетрик(Неопределено);
    Валидатор.ИнтерфейсыРеализованыКорректно(Объект);
КонецПроцедуры

&Тест
Процедура ОтелКомпозитныйПроцессорСпановРеализуетИнтерфейс() Экспорт
    Валидатор = Новый ВалидаторРеализации;
    Объект = Новый ОтелКомпозитныйПроцессорСпанов(Новый Массив);
    Валидатор.ИнтерфейсыРеализованыКорректно(Объект);
КонецПроцедуры

&Тест
Процедура ОтелПакетныйПроцессорСпановРеализуетИнтерфейс() Экспорт
    Валидатор = Новый ВалидаторРеализации;
    МокЭкспортер = Мок.Получить(Тип("ОтелЭкспортерСпанов"));
    Базовый = Новый ОтелБазовыйПакетныйПроцессор(МокЭкспортер, "тест", 2048, 512);
    Объект = Новый ПостроительНаследника(Новый ОтелПакетныйПроцессорСпанов(), Базовый).Построить();
    Валидатор.ИнтерфейсыРеализованыКорректно(Объект);
КонецПроцедуры

&Тест
Процедура ОтелПростойПроцессорСпановРеализуетИнтерфейс() Экспорт
    Валидатор = Новый ВалидаторРеализации;
    Объект = Новый ОтелПростойПроцессорСпанов(Неопределено);
    Валидатор.ИнтерфейсыРеализованыКорректно(Объект);
КонецПроцедуры

&Тест
Процедура ОтелКомпозитныйПроцессорЛоговРеализуетИнтерфейс() Экспорт
    Валидатор = Новый ВалидаторРеализации;
    Объект = Новый ОтелКомпозитныйПроцессорЛогов(Новый Массив);
    Валидатор.ИнтерфейсыРеализованыКорректно(Объект);
КонецПроцедуры

&Тест
Процедура ОтелПакетныйПроцессорЛоговРеализуетИнтерфейс() Экспорт
    Валидатор = Новый ВалидаторРеализации;
    МокЭкспортер = Мок.Получить(Тип("ОтелЭкспортерЛогов"));
    Базовый = Новый ОтелБазовыйПакетныйПроцессор(МокЭкспортер, "тест", 2048, 512);
    Объект = Новый ПостроительНаследника(Новый ОтелПакетныйПроцессорЛогов(), Базовый).Построить();
    Валидатор.ИнтерфейсыРеализованыКорректно(Объект);
КонецПроцедуры

&Тест
Процедура ОтелПростойПроцессорЛоговРеализуетИнтерфейс() Экспорт
    Валидатор = Новый ВалидаторРеализации;
    Объект = Новый ОтелПростойПроцессорЛогов(Неопределено);
    Валидатор.ИнтерфейсыРеализованыКорректно(Объект);
КонецПроцедуры

&Тест
Процедура ОтелПроцессорСобытийВSpanEventsРеализуетИнтерфейс() Экспорт
    Валидатор = Новый ВалидаторРеализации;
    Объект = Новый ОтелПроцессорСобытийВSpanEvents;
    Валидатор.ИнтерфейсыРеализованыКорректно(Объект);
КонецПроцедуры


#КонецОбласти
