// BSLLS:MissingVariablesDescription-off
// BSLLS:PublicMethodsDescription-off
// BSLLS:MissingParameterDescription-off
// BSLLS:MissingReturnedValueDescription-off
#Использовать "../../.."
#Использовать asserts

// BSLLS:DuplicateStringLiteral-off

&Тест
Процедура СозданиеСМинимальнымиПараметрами() Экспорт

    // Дано / Когда
    ОбластьИнструментирования = Новый ОтелОбластьИнструментирования("моя-библиотека");

    // Тогда
    Ожидаем.Что(ОбластьИнструментирования.Имя()).Равно("моя-библиотека");
    Ожидаем.Что(ОбластьИнструментирования.Версия()).Равно("");
    Ожидаем.Что(ОбластьИнструментирования.SchemaUrl()).Равно("");
    Ожидаем.Что(ОбластьИнструментирования.Атрибуты()).Равно(Неопределено);

КонецПроцедуры

&Тест
Процедура СозданиеСоВсемиПараметрами() Экспорт

    // Дано
    АтрибутыОбласти = Новый ОтелАтрибуты();
    АтрибутыОбласти.Установить("scope.key", "scope.val");

    // Когда
    ОбластьИнструментирования = Новый ОтелОбластьИнструментирования("моя-библ", "1.2.3", АтрибутыОбласти, "https://schema.example.com");

    // Тогда
    Ожидаем.Что(ОбластьИнструментирования.Имя()).Равно("моя-библ");
    Ожидаем.Что(ОбластьИнструментирования.Версия()).Равно("1.2.3");
    Ожидаем.Что(ОбластьИнструментирования.SchemaUrl()).Равно("https://schema.example.com");
    Ожидаем.Что(ОбластьИнструментирования.Атрибуты().Получить("scope.key")).Равно("scope.val");

КонецПроцедуры

&Тест
Процедура Ключ() Экспорт

    // Дано
    ОбластьИнструментирования1 = Новый ОтелОбластьИнструментирования("библ1", "1.0");
    ОбластьИнструментирования2 = Новый ОтелОбластьИнструментирования("библ1", "1.0");
    ОбластьИнструментирования3 = Новый ОтелОбластьИнструментирования("библ1", "2.0");

    // Тогда
    Ожидаем.Что(ОбластьИнструментирования1.Ключ()).Равно(ОбластьИнструментирования2.Ключ());
    Ожидаем.Что(ОбластьИнструментирования1.Ключ() <> ОбластьИнструментирования3.Ключ()).Равно(Истина);

КонецПроцедуры
