// BSLLS:MagicNumber-off
#Использовать "../../.."
#Использовать asserts

&ПослеКаждого
Процедура ОчисткаКонтекста() Экспорт
    ОтелКонтекст.Очистить();
КонецПроцедуры

&Тест
Процедура ПустойКонтекст() Экспорт

    // Дано / Когда
    Контекст = ОтелКонтекст.Текущий();

    // Тогда
    Ожидаем.Что(Контекст).ИмеетТип("Соответствие");
    Ожидаем.Что(Контекст.Количество()).Равно(0);

КонецПроцедуры

&Тест
Процедура УстановкаЗначения() Экспорт

    // Дано / Когда
    Область = ОтелКонтекст.УстановитьЗначение("key", "val");

    // Тогда
    Ожидаем.Что(ОтелКонтекст.Получить("key")).Равно("val");

    Область.Закрыть();

КонецПроцедуры

&Тест
Процедура ВложенныеКонтексты() Экспорт

    // Дано
    Область1 = ОтелКонтекст.УстановитьЗначение("key", "val1");
    Ожидаем.Что(ОтелКонтекст.Получить("key")).Равно("val1");

    // Когда
    Область2 = ОтелКонтекст.УстановитьЗначение("key", "val2");

    // Тогда
    Ожидаем.Что(ОтелКонтекст.Получить("key")).Равно("val2");

    Область2.Закрыть();
    Ожидаем.Что(ОтелКонтекст.Получить("key")).Равно("val1");

    Область1.Закрыть();

КонецПроцедуры

&Тест
Процедура ТекущийСпан() Экспорт

    // Дано
    МокСпан = Новый Структура("Имя", "тестовый-спан");

    // Когда
    Область = ОтелКонтекст.СделатьСпанТекущим(МокСпан);

    // Тогда
    Ожидаем.Что(ОтелКонтекст.ТекущийСпан()).Равно(МокСпан);

    Область.Закрыть();

КонецПроцедуры

&Тест
Процедура ТекущийBaggage() Экспорт

    // Дано
    Багаж = Новый ОтелПостроительBaggage()
        .Установить("key", "val")
        .Построить();

    // Когда
    Область = ОтелКонтекст.СделатьBaggageТекущим(Багаж);

    // Тогда
    ТекущийБагаж = ОтелКонтекст.ТекущийBaggage();
    Ожидаем.Что(ТекущийБагаж.Получить("key")).Равно("val");

    Область.Закрыть();

КонецПроцедуры

&Тест
Процедура НезависимостьСпанаИBaggage() Экспорт

    // Дано
    МокСпан = Новый Структура("Имя", "тестовый-спан");
    Багаж = Новый ОтелПостроительBaggage()
        .Установить("key", "val")
        .Построить();

    // Когда
    ОбластьСпана = ОтелКонтекст.СделатьСпанТекущим(МокСпан);
    ОбластьБагажа = ОтелКонтекст.СделатьBaggageТекущим(Багаж);

    // Тогда
    Ожидаем.Что(ОтелКонтекст.ТекущийСпан()).Равно(МокСпан);
    Ожидаем.Что(ОтелКонтекст.ТекущийBaggage().Получить("key")).Равно("val");

    ОбластьБагажа.Закрыть();
    ОбластьСпана.Закрыть();

КонецПроцедуры

&Тест
Процедура Очистить() Экспорт

    // Дано
    ОтелКонтекст.УстановитьЗначение("key1", "val1");
    ОтелКонтекст.УстановитьЗначение("key2", "val2");
    Ожидаем.Что(ОтелКонтекст.Текущий().Количество() > 0).Равно(Истина);

    // Когда
    ОтелКонтекст.Очистить();

    // Тогда
    Ожидаем.Что(ОтелКонтекст.Текущий().Количество()).Равно(0);

КонецПроцедуры
