// BSLLS:MissingVariablesDescription-off
// BSLLS:PublicMethodsDescription-off
// BSLLS:MissingParameterDescription-off
// BSLLS:MissingReturnedValueDescription-off
#Использовать "../../.."
#Использовать asserts

// BSLLS:DuplicateStringLiteral-off

&Тест
Процедура СозданиеСМинимальнымиПараметрами() Экспорт

    // Дано / Когда
    ОбластьИнстр = Новый ОтелОбластьИнструментирования("моя-библиотека");

    // Тогда
    Ожидаем.Что(ОбластьИнстр.Имя()).Равно("моя-библиотека");
    Ожидаем.Что(ОбластьИнстр.Версия()).Равно("");
    Ожидаем.Что(ОбластьИнстр.SchemaUrl()).Равно("");
    Ожидаем.Что(ОбластьИнстр.Атрибуты()).Равно(Неопределено);

КонецПроцедуры

&Тест
Процедура СозданиеСоВсемиПараметрами() Экспорт

    // Дано
    АтрибутыОбласти = Новый ОтелАтрибуты();
    АтрибутыОбласти.Установить("scope.key", "scope.val");

    // Когда
    ОбластьИнстр = Новый ОтелОбластьИнструментирования("моя-библ", "1.2.3", АтрибутыОбласти, "https://schema.example.com");

    // Тогда
    Ожидаем.Что(ОбластьИнстр.Имя()).Равно("моя-библ");
    Ожидаем.Что(ОбластьИнстр.Версия()).Равно("1.2.3");
    Ожидаем.Что(ОбластьИнстр.SchemaUrl()).Равно("https://schema.example.com");
    Ожидаем.Что(ОбластьИнстр.Атрибуты().Получить("scope.key")).Равно("scope.val");

КонецПроцедуры

&Тест
Процедура Ключ() Экспорт

    // Дано
    ОбластьИнстр1 = Новый ОтелОбластьИнструментирования("библ1", "1.0");
    ОбластьИнстр2 = Новый ОтелОбластьИнструментирования("библ1", "1.0");
    ОбластьИнстр3 = Новый ОтелОбластьИнструментирования("библ1", "2.0");

    // Тогда
    Ожидаем.Что(ОбластьИнстр1.Ключ()).Равно(ОбластьИнстр2.Ключ());
    Ожидаем.Что(ОбластьИнстр1.Ключ() <> ОбластьИнстр3.Ключ()).Равно(Истина);

КонецПроцедуры
