// BSLLS:MagicNumber-off
#Использовать "../../.."
#Использовать asserts

&ПослеКаждого
Процедура Очистка() Экспорт
    ОтелГлобальный.Сброс();
КонецПроцедуры

&Тест
Процедура ИзначальноПуст() Экспорт

    // Дано / Когда / Тогда
    Ожидаем.Что(ОтелГлобальный.Получить()).Равно(Неопределено);

КонецПроцедуры

&Тест
Процедура УстановкаИПолучение() Экспорт

    // Дано
    МокСдк = Новый Структура("Тип", "SDK");

    // Когда
    ОтелГлобальный.Установить(МокСдк);

    // Тогда
    Ожидаем.Что(ОтелГлобальный.Получить()).Равно(МокСдк);

КонецПроцедуры

&Тест
Процедура ПовторнаяУстановкаВызываетИсключение() Экспорт

    // Дано
    МокСдк1 = Новый Структура("Тип", "SDK1");
    МокСдк2 = Новый Структура("Тип", "SDK2");
    ОтелГлобальный.Установить(МокСдк1);

    // Когда
    ИсключениеВызвано = Ложь;
    Попытка
        ОтелГлобальный.Установить(МокСдк2);
    Исключение
        ИсключениеВызвано = Истина;
    КонецПопытки;

    // Тогда
    Ожидаем.Что(ИсключениеВызвано).Равно(Истина);

КонецПроцедуры

&Тест
Процедура Сброс() Экспорт

    // Дано
    МокСдк = Новый Структура("Тип", "SDK");
    ОтелГлобальный.Установить(МокСдк);

    // Когда
    ОтелГлобальный.Сброс();

    // Тогда
    Ожидаем.Что(ОтелГлобальный.Получить()).Равно(Неопределено);

КонецПроцедуры

&Тест
Процедура ПовторнаяУстановкаПослеСброса() Экспорт

    // Дано
    МокСдк1 = Новый Структура("Тип", "SDK1");
    МокСдк2 = Новый Структура("Тип", "SDK2");

    ОтелГлобальный.Установить(МокСдк1);
    ОтелГлобальный.Сброс();

    // Когда
    ИсключениеВызвано = Ложь;
    Попытка
        ОтелГлобальный.Установить(МокСдк2);
    Исключение
        ИсключениеВызвано = Истина;
    КонецПопытки;

    // Тогда
    Ожидаем.Что(ИсключениеВызвано).Равно(Ложь);
    Ожидаем.Что(ОтелГлобальный.Получить()).Равно(МокСдк2);

КонецПроцедуры

&Тест
Процедура ОтсутствиеИнициализацииВызываетИсключение() Экспорт

    // Дано / Когда
    ИсключениеВызвано = Ложь;
    Попытка
        ОтелГлобальный.ПолучитьТрассировщик("тест");
    Исключение
        ИсключениеВызвано = Истина;
    КонецПопытки;

    // Тогда
    Ожидаем.Что(ИсключениеВызвано).Равно(Истина);

КонецПроцедуры
