// BSLLS:UnusedLocalVariable-off
// BSLLS:ExportVariables-off
// Конфигурация провайдера логирования (LoggerProvider).
//
// Соответствует секции logger_provider в файле конфигурации.

#Область ОписаниеПеременных

// processors - Массив из ОтелКонфигурацияПакетногоПроцессора, ОтелКонфигурацияПростогоПроцессора,
// ОтелКонфигурацияКомпонента - процессоры; процессор, которого нет в SDK, - ОтелКонфигурацияКомпонента
Перем Процессоры Экспорт;

// limits - ОтелКонфигурацияЛимитовАтрибутов - лимиты записей лога
// Использует ОтелКонфигурацияЛимитовАтрибутов т.к. совпадает со схемой attribute_limits
Перем Лимиты Экспорт;

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриСозданииОбъекта()
	Процессоры = Новый Массив;
	Лимиты = Неопределено;
КонецПроцедуры

#КонецОбласти
