// BSLLS:UnusedLocalVariable-off
// BSLLS:ExportVariables-off
// Конфигурация провайдера метрик (MeterProvider).
//
// Соответствует секции meter_provider в файле конфигурации.

#Область ОписаниеПеременных

// readers - Массив из ОтелКонфигурацияПериодическогоЧитателя, ОтелКонфигурацияPullЧитателя - читатели
Перем Читатели Экспорт;

// exemplar_filter - Строка - фильтр экземпляров
// Значения: "trace_based", "always_on", "always_off"
Перем ФильтрЭкземпляров Экспорт;

// views - Массив из ОтелКонфигурацияПредставления - представления (View); пустой массив - без
// представлений
Перем Представления Экспорт;

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриСозданииОбъекта()
	Читатели = Новый Массив;
	ФильтрЭкземпляров = "trace_based";
	Представления = Новый Массив;
КонецПроцедуры

#КонецОбласти
