// BSLLS:UnusedLocalVariable-off
// BSLLS:ExportVariables-off
// Конфигурация провайдера трассировки (TracerProvider).
//
// Соответствует секции tracer_provider в файле конфигурации.

#Область ОписаниеПеременных

// processors - Массив из ОтелКонфигурацияПакетногоПроцессора, ОтелКонфигурацияПростогоПроцессора,
// ОтелКонфигурацияКомпонента - процессоры; процессор, которого нет в SDK, - ОтелКонфигурацияКомпонента
Перем Процессоры Экспорт;

// limits - ОтелКонфигурацияЛимитовСпана
Перем Лимиты Экспорт;

// sampler - ОтелКонфигурацияСэмплера, ОтелКонфигурацияКомпонента - сэмплер; сэмплер, которого нет в SDK, -
// ОтелКонфигурацияКомпонента
Перем Сэмплер Экспорт;

// id_generator - ОтелКонфигурацияКомпонента, Неопределено - генератор ID; Неопределено - random
Перем ГенераторИд Экспорт;

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриСозданииОбъекта()
	Процессоры = Новый Массив;
	Лимиты = Неопределено;
	Сэмплер = Неопределено;
	ГенераторИд = Неопределено;
КонецПроцедуры

#КонецОбласти
