// BSLLS:MagicNumber-off
#Использовать "../../.."
#Использовать asserts
#Использовать moskito

&Тест
Процедура ДелегацияОбработки() Экспорт

    // Дано — два мок-процессора
    ОтелКонтекст.Очистить();
    ЭкспортерДляМока = Новый ОтелВПамятьЭкспортерЛогов();
    МокПроцессор1 = Мок.Получить(Новый ОтелПростойПроцессорЛогов(ЭкспортерДляМока));
    МокПроцессор2 = Мок.Получить(Новый ОтелПростойПроцессорЛогов(ЭкспортерДляМока));
    Процессоры = Новый Массив();
    Процессоры.Добавить(МокПроцессор1);
    Процессоры.Добавить(МокПроцессор2);
    КомпозитныйПроцессор = Новый ОтелКомпозитныйПроцессорЛогов(Процессоры);

    Ресурс = Новый ОтелРесурс(Истина);
    Запись = Новый ОтелЗаписьЛога();
    Запись.УстановитьТело("composite test");

    // Когда
    КомпозитныйПроцессор.Обработать(Запись, Ресурс, "test-lib", "1.0");

    // Тогда — оба процессора получили вызов Обработать
    МокПроцессор1.ПроверитьЧтоВызывалсяМетод().Обработать(
        Матчеры.ЛюбоеЗначение(),
        Матчеры.ЛюбоеЗначение(),
        Матчеры.ЛюбоеЗначение(),
        Матчеры.ЛюбоеЗначение(),
        Матчеры.ЛюбоеЗначение()
    );
    МокПроцессор2.ПроверитьЧтоВызывалсяМетод().Обработать(
        Матчеры.ЛюбоеЗначение(),
        Матчеры.ЛюбоеЗначение(),
        Матчеры.ЛюбоеЗначение(),
        Матчеры.ЛюбоеЗначение(),
        Матчеры.ЛюбоеЗначение()
    );

    ОтелКонтекст.Очистить();

КонецПроцедуры

&Тест
Процедура ДелегацияЗакрытия() Экспорт

    // Дано — два мок-процессора
    ЭкспортерДляМока = Новый ОтелВПамятьЭкспортерЛогов();
    МокПроцессор1 = Мок.Получить(Новый ОтелПростойПроцессорЛогов(ЭкспортерДляМока));
    МокПроцессор2 = Мок.Получить(Новый ОтелПростойПроцессорЛогов(ЭкспортерДляМока));
    Процессоры = Новый Массив();
    Процессоры.Добавить(МокПроцессор1);
    Процессоры.Добавить(МокПроцессор2);
    КомпозитныйПроцессор = Новый ОтелКомпозитныйПроцессорЛогов(Процессоры);

    // Когда
    КомпозитныйПроцессор.Закрыть();

    // Тогда — оба процессора получили вызов Закрыть
    МокПроцессор1.ПроверитьЧтоВызывалсяМетод().Закрыть();
    МокПроцессор2.ПроверитьЧтоВызывалсяМетод().Закрыть();

КонецПроцедуры
