// BSLLS:MagicNumber-off
#Использовать "../../.."
#Использовать asserts
#Использовать moskito

&Тест
Процедура ДелегацияОбработки() Экспорт
    // Дано
    МокПроцессор1 = Мок.Получить(Новый ОтелПростойПроцессорСпанов(Новый ОтелВПамятьЭкспортерСпанов()));
    МокПроцессор2 = Мок.Получить(Новый ОтелПростойПроцессорСпанов(Новый ОтелВПамятьЭкспортерСпанов()));
    Процессоры = Новый Массив();
    Процессоры.Добавить(МокПроцессор1);
    Процессоры.Добавить(МокПроцессор2);
    Композитный = Новый ОтелКомпозитныйПроцессорСпанов(Процессоры);

    Ресурс = Новый ОтелРесурс(Истина);
    Спан = Новый ОтелСпан("тест", Ресурс, "библ", "1.0");
    Спан.Завершить();

    // Когда
    Композитный.Обработать(Спан);

    // Тогда — оба процессора вызваны
    МокПроцессор1.ПроверитьЧтоВызывалсяМетод().Обработать(Матчеры.ЛюбоеЗначение());
    МокПроцессор2.ПроверитьЧтоВызывалсяМетод().Обработать(Матчеры.ЛюбоеЗначение());
КонецПроцедуры

&Тест
Процедура ДелегацияЗакрытия() Экспорт
    // Дано
    МокПроцессор1 = Мок.Получить(Новый ОтелПростойПроцессорСпанов(Новый ОтелВПамятьЭкспортерСпанов()));
    МокПроцессор2 = Мок.Получить(Новый ОтелПростойПроцессорСпанов(Новый ОтелВПамятьЭкспортерСпанов()));
    Процессоры = Новый Массив();
    Процессоры.Добавить(МокПроцессор1);
    Процессоры.Добавить(МокПроцессор2);
    Композитный = Новый ОтелКомпозитныйПроцессорСпанов(Процессоры);

    // Когда
    Композитный.Закрыть();

    // Тогда — оба процессора закрыты
    МокПроцессор1.ПроверитьЧтоВызывалсяМетод().Закрыть();
    МокПроцессор2.ПроверитьЧтоВызывалсяМетод().Закрыть();
КонецПроцедуры
