// BSLLS:MissingVariablesDescription-off
// BSLLS:PublicMethodsDescription-off
// BSLLS:MissingParameterDescription-off
// BSLLS:MissingReturnedValueDescription-off
#Использовать "../../.."
#Использовать asserts

// Тесты для модуля ОтелСелекторВременнойАгрегации

&Тест
Процедура ПредпочтительноДельта_Счетчик() Экспорт

    // Дано
    Селектор = ОтелСелекторВременнойАгрегации.ПредпочтительноДельта();

    // Когда
    Результат = Селектор.Применить("counter");

    // Тогда
    Ожидаем.Что(Результат).Равно(ОтелВременнаяАгрегация.Дельта());

КонецПроцедуры

&Тест
Процедура ПредпочтительноДельта_Гистограмма() Экспорт

    // Дано
    Селектор = ОтелСелекторВременнойАгрегации.ПредпочтительноДельта();

    // Когда
    Результат = Селектор.Применить("histogram");

    // Тогда
    Ожидаем.Что(Результат).Равно(ОтелВременнаяАгрегация.Дельта());

КонецПроцедуры

&Тест
Процедура ПредпочтительноДельта_UpDownCounter_Кумулятивная() Экспорт

    // Дано
    Селектор = ОтелСелекторВременнойАгрегации.ПредпочтительноДельта();

    // Когда
    Результат = Селектор.Применить("up_down_counter");

    // Тогда
    Ожидаем.Что(Результат).Равно(ОтелВременнаяАгрегация.Кумулятивная());

КонецПроцедуры

&Тест
Процедура ПредпочтительноДельта_ObservableUpDownCounter_Кумулятивная() Экспорт

    // Дано
    Селектор = ОтелСелекторВременнойАгрегации.ПредпочтительноДельта();

    // Когда
    Результат = Селектор.Применить("observable_up_down_counter");

    // Тогда
    Ожидаем.Что(Результат).Равно(ОтелВременнаяАгрегация.Кумулятивная());

КонецПроцедуры

&Тест
Процедура НизкоеПотреблениеПамяти_Счетчик() Экспорт

    // Дано
    Селектор = ОтелСелекторВременнойАгрегации.НизкоеПотреблениеПамяти();

    // Когда
    Результат = Селектор.Применить("counter");

    // Тогда
    Ожидаем.Что(Результат).Равно(ОтелВременнаяАгрегация.Дельта());

КонецПроцедуры

&Тест
Процедура НизкоеПотреблениеПамяти_UpDownCounter() Экспорт

    // Дано
    Селектор = ОтелСелекторВременнойАгрегации.НизкоеПотреблениеПамяти();

    // Когда
    Результат = Селектор.Применить("up_down_counter");

    // Тогда
    Ожидаем.Что(Результат).Равно(ОтелВременнаяАгрегация.Дельта());

КонецПроцедуры
