// BSLLS:MagicNumber-off
// BSLLS:MissingVariablesDescription-off
// BSLLS:PublicMethodsDescription-off
// BSLLS:MissingParameterDescription-off
// BSLLS:MissingReturnedValueDescription-off
#Использовать "../../.."
#Использовать asserts

&Тест
Процедура ВсегдаВыключенНеЗахватывает() Экспорт

    // Тогда
    Ожидаем.Что(ОтелФильтрЭкземпляров.ДолженЗахватить(ОтелФильтрЭкземпляров.ВсегдаВыключен())).Равно(Ложь);

КонецПроцедуры

&Тест
Процедура ВсегдаВключенЗахватывает() Экспорт

    // Тогда
    Ожидаем.Что(ОтелФильтрЭкземпляров.ДолженЗахватить(ОтелФильтрЭкземпляров.ВсегдаВключен())).Равно(Истина);

КонецПроцедуры

&Тест
Процедура ПоТрассировкеБезАктивногоСпана() Экспорт

    // Дано - нет активного спана
    ОтелКонтекст.Очистить();

    // Тогда - без активного спана не захватываем
    Ожидаем.Что(ОтелФильтрЭкземпляров.ДолженЗахватить(ОтелФильтрЭкземпляров.ПоТрассировке())).Равно(Ложь);

    ОтелКонтекст.Очистить();

КонецПроцедуры

&Тест
Процедура ПоТрассировкеСАктивнымСпаном() Экспорт

    // Дано - есть активный спан
    ОтелКонтекст.Очистить();
    Ресурс = Новый ОтелРесурс(Истина);
    ОбластьИнстр = Новый ОтелОбластьИнструментирования("библ", "1.0");
    Спан = Новый ОтелСпан("тест", Ресурс, ОбластьИнстр);
    ОтелКонтекст.СделатьСпанТекущим(Спан);

    // Тогда - с активным спаном захватываем
    Ожидаем.Что(ОтелФильтрЭкземпляров.ДолженЗахватить(ОтелФильтрЭкземпляров.ПоТрассировке())).Равно(Истина);

    // Очистка
    Спан.Завершить();
    ОтелКонтекст.Очистить();

КонецПроцедуры
