#Область ПрограммныйИнтерфейс

// Обнаруживает ресурс экземпляра сервиса.
//
// Возвращаемое значение:
//   ОтелРесурс - ресурс с атрибутом service.instance.id
//
Функция Обнаружить() Экспорт
    Атрибуты = Новый Соответствие();
    Атрибуты.Вставить("service.instance.id", ОтелУтилиты.ИдЭкземпляраСервиса());
    Возврат ОтелУтилиты.РесурсДетектора(Атрибуты, "https://opentelemetry.io/schemas/1.44.0");
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&Реализует("ИнтерфейсДетекторРесурса")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

#КонецОбласти
