#Использовать logos

#Область ОписаниеПеременных

// Логгер logos - логгер для диагностических сообщений
Перем Лог;

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Обнаруживает ресурс процесса.
//
// Возвращаемое значение:
//   ОтелРесурс - ресурс с атрибутами процесса
//
Функция Обнаружить() Экспорт
    Атрибуты = Новый Соответствие();
    Попытка
        Атрибуты.Вставить("process.pid", ТекущийПроцесс().Идентификатор);
    Исключение
        // По Resource SDK spec: ошибка во время детектирования SHOULD считаться ошибкой.
        Лог.Ошибка("Нет доступа к PID: %1", ОписаниеОшибки());
    КонецПопытки;
    // Schema URL - версия semconv атрибутов process.*, у ресурса без атрибутов - пустой
    Возврат ОтелУтилиты.РесурсДетектора(Атрибуты, "https://opentelemetry.io/schemas/1.29.0");
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПриСозданииОбъекта()
    Лог = Логирование.ПолучитьЛог("oscript.lib.opentelemetry.resource.process");
КонецПроцедуры

#КонецОбласти
